app/views/jobs/_job.html.erb

	<br>
	<% job.boats.each do |boat| %>
---
SELECT "boats".* FROM "boats" INNER JOIN "boatjobs" ON "boats"."id" = "boatjobs"."boat_id" WHERE "boatjobs"."job_id" = ?  [["job_id", 1]]