app/views/jobs/index.html.erb

<!-- shows all of the jobs -->
<%= select_tag "boat", options_for_select(@boats.collect{|boat| ["#{boat.name} Containers: #{boat.containers}", boat.id ]}) %>
---
SELECT "boats".* FROM "boats"