app/controllers/boatjobs_controller.rb

	def create
		@boat = Boat.find(params[:boat_id])
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]