app/controllers/boats_controller.rb

SELECT "boats".* FROM "boats"
---
  def index
    @boats = Boat.all

INSERT INTO "boats" ("created_at", "updated_at", "user_id", "name", "containers", "location") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", 2016-12-17 00:55:14 UTC], ["updated_at", 2016-12-17 00:55:14 UTC], ["user_id", 1], ["name", "Fury"], ["containers", 78], ["location", "Fiji"]]
---
  def create
    @boat = current_user.boats.new(boat_params)
    if @boat.save