app/controllers/jobs_controller.rb

  def index
    @jobs = Job.all
    @boats = Boat.all
---
SELECT "boats".* FROM "boats"

  def new
    @job = Job.new
    @boat = Boat.find(params[:boat_id])
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
    @boat = Boat.find(params[:boat_id])
    @job = @boat.jobs.new(job_params)

    if @job.save
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "boatjobs" ("created_at", "updated_at", "job_id", "boat_id") VALUES (?, ?, ?, ?)  [["created_at", 2016-12-20 00:41:37 UTC], ["updated_at", 2016-12-20 00:41:37 UTC], ["job_id", 1], ["boat_id", 1]]